packages/windmapper/windmapper-2.1.14-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.14.data/data/share/windninja/ninjafoam/8/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
$boundaryField$
    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
